// создавать и удалять пользователя
// наполянть корзину до регистрации пользователя
// в корзине (список покупок цена количество и общая стоиомсть) кнопка сохранения заказа
// категории товаров
// простые пользователи
// суперпользователь который может | добавлять менять удалять товары | видны заказы


// index
// login
// logout
// register
// add_prod
//


<?php

$catygory = [
	'val1',
	'val2',
	'val3'
];

$prod = [
    'img_url' => 'val',
    'name' => 'val',
    'description' => 'val',
    'cat' => '',
    'price' => 0
];

$user = [
	'is_superuser' => true/false,
	'name' => 'val',
	'pswd' => 'val',
	'mail' => 'val',
	'phone' => 'val'
];